app/views/items/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."item_id" = ? LIMIT ?  [["user_id", 1], ["item_id", 1], ["LIMIT", 1]]
---
				<td><%= @item.body %></td>
				<td><% if Like.find_by(user_id: @current_user.id,item_id: @item.id)%>