app/controllers/application_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def set_current_admin
     @current_admin = Admin.find_by(id: session[:admin_id])