app/controllers/items_controller.rb

INSERT INTO "items" ("user_id", "title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "pythonの使い方"], ["category", "a"], ["body", "a"], ["created_at", "2020-03-25 07:47:53.345530"], ["updated_at", "2020-03-25 07:47:53.345530"]]
---
  def create
  	  @item = Item.new(item_params)
      @item.user_id = @current_user.id
  	  if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
      @item = Item.find(params[:id])