app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["item_id", 2], ["created_at", "2020-03-25 09:27:25.601014"], ["updated_at", "2020-03-25 09:27:25.601014"]]
---
	def create
		@like = Like.new(like_params)
		@like.save

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
	def destroy
		@like = Like.find_by(like_params)
		@like.destroy