app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "a"], ["email", "a@a"], ["password", "a"], ["created_at", "2020-03-24 23:51:22.137789"], ["updated_at", "2020-03-24 23:51:22.137789"]]