app/models/user.rb

INSERT INTO "relationships" ("user_id", "follow_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["follow_id", 1], ["created_at", "2020-03-25 09:44:04.117109"], ["updated_at", "2020-03-25 09:44:04.117109"]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]
---
  def follow(other_user)
    unless self == other_user
      self.relationships.find_or_create_by(follow_id: other_user.id)

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def unfollow(other_user)
    relationship = self.relationships.find_by(follow_id: other_user.id)
    relationship.destroy if relationship

SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follow_id" WHERE "relationships"."user_id" = ? AND "users"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def following?(other_user)
    self.followings.include?(other_user)